In [ ]:
# Trabalhando com Nans

In [1]:
import pandas as pd
import numpy as np

data = {
    "nome":["João", "Maria", "José", "Pedro", "Ana", "Carlos"],
    "idade":[31, 23, 43, 24, np.nan, 54],
    "renda":[1000, np.nan, 3000, np.nan, 4000, 5000]
}

In [2]:
df = pd.DataFrame(data)
df

     nome  idade   renda
0    João   31.0  1000.0
1   Maria   23.0     NaN
2    José   43.0  3000.0
3   Pedro   24.0     NaN
4     Ana    NaN  4000.0
5  Carlos   54.0  5000.0

In [10]:
df["idade"].isna().sum() # Conta os valores nulos de uma coluna

df.isna().sum() # Conta os valores nulos de todas as colunas

nome     0
idade    1
renda    2
dtype: int64

In [12]:
df.fillna(0) # Substitui os valores nulos por 0  ou por qualquer outro valor


df.fillna({
    "idade": df["idade"].mean(),
    "renda": df["renda"].mean()
    }) # Substitui os valores nulos pela média da coluna

     nome  idade   renda
0    João   31.0  1000.0
1   Maria   23.0  3250.0
2    José   43.0  3000.0
3   Pedro   24.0  3250.0
4     Ana   35.0  4000.0
5  Carlos   54.0  5000.0

In [21]:
df.dropna() # Remove as linhas que contém valores nulos

df.dropna(how="all") # Remove as linhas que contém todos os valores nulos

df.dropna(subset=["idade"]) # Remove as linhas que contém valores nulos na coluna idade

df.dropna(subset=["idade", "renda"], how='any') # Remove as linhas que contém valores nulos nas colunas idade e renda

df.dropna(axis=1, how='any') # Remove as colunas que contém valores nulos

     nome
0    João
1   Maria
2    José
3   Pedro
4     Ana
5  Carlos